from cat import Cat, CatArray

# Створення екземплярів класу Cat
cat1 = Cat("Барсик", "Персидська", "білий", 0.3, 1.5, "довгошерстий")
cat2 = Cat("Мурзик", "Сіамська", "сірий", 2, 4.5, "короткошерстий")
cat3 = Cat("Рижик", "Абіссинська", "рожевий", 1.5, 3.0, "короткошерстий")
cat4 = Cat("Вася", "Британська", "сіро-білий", 0.5, 2.0, "довгошерстий")
cat5 = Cat("Том", "Бенгальська", "мармуровий", 3, 5.5, "короткошерстий")

# Створення екземпляру класу CatArray
cat_array = CatArray([cat1, cat2, cat3])

# Демонстрація роботи реалізованих функцій
print("Початковий масив котів:")
print(cat_array)
print("Довжина масиву котів:", len(cat_array))
print("Перший елемент масиву:", cat_array[0])

# Перевірка наявності кота у масиві перед викликом методу index()
if cat4 in cat_array:
    print("Індекс кота Васі в масиві:", cat_array.index(cat4))
else:
    print("Кіт з іменем 'Вася' відсутній у масиві.")

# Видалення кота Мурзика з масиву
cat_array.remove(cat2)
print("Масив котів після видалення кота Мурзика:")
print(cat_array)

cat_array.append(cat5)
print("Масив котів після додавання кота Тома:")
print(cat_array)

cat_array.insert(1, cat2)
print("Масив котів після вставки кота Мурзика на другу позицію:")
print(cat_array)

print("Масив котів після реверсу:")
cat_array.reverse()
print(cat_array)

print("Кількість котів з іменем 'Барсик' в масиві:", cat_array.count(cat1))

print("Видалення останнього кота з масиву і повернення його:")
last_cat = cat_array.pop()
print(last_cat)

print("Оновлений масив котів:")
print(cat_array)
